In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df_account = pd.read_csv('account.csv')
df_card = pd.read_csv("card.csv")
df_client = pd.read_csv("client.csv")
df_disp = pd.read_csv("disp.csv")
df_district = pd.read_csv("district.csv")
df_loan = pd.read_csv("loan.csv")
df_order = pd.read_csv("order.csv")
df_trans = pd.read_csv("trans.csv", sep=';')

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
def head_df(df):
    return df.head()

In [4]:
df = [df_account, df_card, df_client, df_disp, df_district, df_loan, df_order, df_trans]

In [5]:
for i in df:
    print(head_df(i))

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102
   card_id  disp_id     type           issued
0     1005     9285  classic  931107 00:00:00
1      104      588  classic  940119 00:00:00
2      747     4915  classic  940205 00:00:00
3       70      439  classic  940208 00:00:00
4      577     3687  classic  940215 00:00:00
   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5
   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT
   A1           A2               A3       A4  A5  A6  A7  A8  A9    A10  \
0   1  Hl.m. Praha           Prague  1204953   0   0   0   1   1  100.0
1   2      Benesov  central Bohemia    88884  80  26   6   2   5   46.7
2   3       Beroun  central Bohemia    75232  55  26   4   1   5   41.7
3   4       Kladno  central Bohemia   149893  63  29   6   2   6   67.4
4   5        Kolin  central Bohemia    95616  65  30   4   1   6   51.4

     A11   A12   A13  A14    A15    A16
0  12541  0.29  0.43  167  85677  99107
1   8507  1.67  1.85  132   2159   2674
2   8980  1.95  2.21  111   2824   2813
3   9753  4.64  5.05  109   5244   5892
4   9307  3.85  4.43  118   2616   3040
   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12      8033      B
1     5316        1801  930711  165960        36      4610      A
2     6863        9188  930728  127080        60      2118      A
3     5325        1843  930803  105804        36      2939      A
4     7240       11013  930906  274740        60      4579      A
   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0
   trans_id  account_id    date    type operation  amount  balance k_symbol  \
0    695247        2378  930101  PRIJEM     VKLAD   700.0    700.0      NaN
1    171812         576  930101  PRIJEM     VKLAD   900.0    900.0      NaN
2    207264         704  930101  PRIJEM     VKLAD  1000.0   1000.0      NaN
3   1117247        3818  930101  PRIJEM     VKLAD   600.0    600.0      NaN
4    579373        1972  930102  PRIJEM     VKLAD   400.0    400.0      NaN

  bank  account
0  NaN      NaN
1  NaN      NaN
2  NaN      NaN
3  NaN      NaN
4  NaN      NaN

In [6]:
#defining function for dataframe information

def data_info(df):
    print("Intial information of Data ")
    return df.info()

In [7]:
data_info(df_account)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   account_id   4500 non-null   int64
 1   district_id  4500 non-null   int64
 2   frequency    4500 non-null   object
 3   date         4500 non-null   int64
dtypes: int64(3), object(1)
memory usage: 140.8+ KB

In [8]:
data_info(df_card)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   card_id  892 non-null    int64
 1   disp_id  892 non-null    int64
 2   type     892 non-null    object
 3   issued   892 non-null    object
dtypes: int64(2), object(2)
memory usage: 28.0+ KB

In [9]:
data_info(df_client)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   client_id     5369 non-null   int64
 1   birth_number  5369 non-null   int64
 2   district_id   5369 non-null   int64
dtypes: int64(3)
memory usage: 126.0 KB

In [10]:
data_info(df_disp)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   disp_id     5369 non-null   int64
 1   client_id   5369 non-null   int64
 2   account_id  5369 non-null   int64
 3   type        5369 non-null   object
dtypes: int64(3), object(1)
memory usage: 167.9+ KB

In [11]:
data_info(df_district)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      77 non-null     int64
 1   A2      77 non-null     object
 2   A3      77 non-null     object
 3   A4      77 non-null     int64
 4   A5      77 non-null     int64
 5   A6      77 non-null     int64
 6   A7      77 non-null     int64
 7   A8      77 non-null     int64
 8   A9      77 non-null     int64
 9   A10     77 non-null     float64
 10  A11     77 non-null     int64
 11  A12     77 non-null     object
 12  A13     77 non-null     float64
 13  A14     77 non-null     int64
 14  A15     77 non-null     object
 15  A16     77 non-null     int64
dtypes: float64(2), int64(10), object(4)
memory usage: 9.8+ KB

In [12]:
data_info(df_load)

NameError: name 'df_load' is not defined

In [16]:
data_info(df_order)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6471 entries, 0 to 6470
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    6471 non-null   int64
 1   account_id  6471 non-null   int64
 2   bank_to     6471 non-null   object
 3   account_to  6471 non-null   int64
 4   amount      6471 non-null   float64
 5   k_symbol    6471 non-null   object
dtypes: float64(1), int64(3), object(2)
memory usage: 303.5+ KB

In [17]:
data_info(df_trans)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1056320 entries, 0 to 1056319
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   trans_id    1056320 non-null  int64
 1   account_id  1056320 non-null  int64
 2   date        1056320 non-null  int64
 3   type        1056320 non-null  object
 4   operation   873206 non-null   object
 5   amount      1056320 non-null  float64
 6   balance     1056320 non-null  float64
 7   k_symbol    574439 non-null   object
 8   bank        273508 non-null   object
 9   account     295389 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 80.6+ MB

In [18]:
# function for getting description of data
def data_describe(dataframe):
    print("Data Description")
    return dataframe.describe()

In [19]:
#dataframes = ['df_card', 'df_client', 'df_disp', 'df_district', 'df_load', 'df_order', 'df_trans']

In [20]:
data_describe(df_card)

Data Description

           card_id       disp_id
count   892.000000    892.000000
mean    480.855381   3511.862108
std     306.933982   2984.373626
min       1.000000      9.000000
25%     229.750000   1387.000000
50%     456.500000   2938.500000
75%     684.250000   4459.500000
max    1247.000000  13660.000000

In [21]:
data_describe(df_client)

Data Description

          client_id   birth_number  district_id
count   5369.000000    5369.000000  5369.000000
mean    3359.011920  535114.970013    37.310114
std     2832.911984  172895.618429    25.043690
min        1.000000  110820.000000     1.000000
25%     1418.000000  406009.000000    14.000000
50%     2839.000000  540829.000000    38.000000
75%     4257.000000  681013.000000    60.000000
max    13998.000000  875927.000000    77.000000

In [22]:
data_describe(df_disp)

Data Description

            disp_id     client_id    account_id
count   5369.000000   5369.000000   5369.000000
mean    3337.097970   3359.011920   2767.496927
std     2770.418826   2832.911984   2307.843630
min        1.000000      1.000000      1.000000
25%     1418.000000   1418.000000   1178.000000
50%     2839.000000   2839.000000   2349.000000
75%     4257.000000   4257.000000   3526.000000
max    13690.000000  13998.000000  11382.000000

In [23]:
data_describe(df_district)

Data Description

,A1,A4,A5,A6,A7,A8,A9,A10,A11,A13,A14,A16
count,77.000000,7.700000e+01,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000
mean,39.000000,1.338849e+05,48.623377,24.324675,6.272727,1.727273,6.259740,63.035065,9031.675325,3.787013,116.129870,5030.831169
std,22.371857,1.369135e+05,32.741829,12.780991,4.015222,1.008338,2.435497,16.221727,790.202347,1.908480,16.608773,11270.796786
min,1.000000,4.282100e+04,0.000000,0.000000,0.000000,0.000000,1.000000,33.900000,8110.000000,0.430000,81.000000,888.000000
25%,20.000000,8.585200e+04,22.000000,16.000000,4.000000,1.000000,5.000000,51.900000,8512.000000,2.310000,105.000000,2122.000000
50%,39.000000,1.088710e+05,49.000000,25.000000,6.000000,2.000000,6.000000,59.800000,8814.000000,3.600000,113.000000,3040.000000
75%,58.000000,1.390120e+05,71.000000,32.000000,8.000000,2.000000,8.000000,73.500000,9317.000000,4.790000,126.000000,4595.000000
max,77.000000,1.204953e+06,151.000000,70.000000,20.000000,5.000000,11.000000,100.000000,12541.000000,9.400000,167.000000,99107.000000

In [24]:
data_describe(df_order)

Data Description

           order_id    account_id    account_to        amount
count   6471.000000   6471.000000  6.471000e+03   6471.000000
mean   33778.197497   2962.302890  4.939904e+07   3280.635698
std     3737.681949   2518.503228  2.888356e+07   2714.475335
min    29401.000000      1.000000  3.990000e+02      1.000000
25%    31187.500000   1223.000000  2.415918e+07   1241.500000
50%    32988.000000   2433.000000  4.975606e+07   2596.000000
75%    34785.500000   3645.500000  7.400045e+07   4613.500000
max    46338.000000  11362.000000  9.999420e+07  14882.000000

In [25]:
data_describe(df_trans)

Data Description

,trans_id,account_id,date,amount,balance,account
count,1.056320e+06,1.056320e+06,1.056320e+06,1.056320e+06,1.056320e+06,2.953890e+05
mean,1.335311e+06,2.936867e+03,9.656748e+05,5.924146e+03,3.851833e+04,4.567092e+07
std,1.227487e+06,2.477345e+03,1.394535e+04,9.522735e+03,2.211787e+04,3.066340e+07
min,1.000000e+00,1.000000e+00,9.301010e+05,0.000000e+00,-4.112570e+04,0.000000e+00
25%,4.302628e+05,1.204000e+03,9.601160e+05,1.359000e+02,2.240250e+04,1.782858e+07
50%,8.585065e+05,2.434000e+03,9.704100e+05,2.100000e+03,3.314340e+04,4.575095e+07
75%,2.060979e+06,3.660000e+03,9.802280e+05,6.800000e+03,4.960362e+04,7.201341e+07
max,3.682987e+06,1.138200e+04,9.812310e+05,8.740000e+04,2.096370e+05,9.999420e+07

In [26]:
#function to check null value
def checking_null(df):
    print("dataframe null value check")
    return df.isna().sum()

In [27]:
#dataframes = ['df_card', 'df_client', 'df_disp', 'df_district', 'df_load', 'df_order', 'df_trans']

In [28]:
checking_null(df_card)

dataframe null value check

card_id    0
disp_id    0
type       0
issued     0
dtype: int64

In [29]:
checking_null(df_client)

dataframe null value check

client_id       0
birth_number    0
district_id     0
dtype: int64

In [30]:
checking_null(df_disp)

dataframe null value check

disp_id       0
client_id     0
account_id    0
type          0
dtype: int64

In [31]:
checking_null(df_district)

dataframe null value check

A1     0
A2     0
A3     0
A4     0
A5     0
A6     0
A7     0
A8     0
A9     0
A10    0
A11    0
A12    0
A13    0
A14    0
A15    0
A16    0
dtype: int64

In [32]:
df_account.isna().sum()

account_id     0
district_id    0
frequency      0
date           0
dtype: int64

In [33]:
df_account.isnull().sum()

account_id     0
district_id    0
frequency      0
date           0
dtype: int64

In [34]:
df_account.head()

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102

In [35]:
df_account.value_counts()

account_id  district_id  frequency         date
1           18           POPLATEK MESICNE  950324    1
3153        2            POPLATEK MESICNE  960705    1
3160        22           POPLATEK MESICNE  940619    1
3158        71           POPLATEK MESICNE  961003    1
3157        77           POPLATEK MESICNE  930910    1
                                                    ..
1585        42           POPLATEK MESICNE  960223    1
1586        1            POPLATEK MESICNE  961003    1
1587        1            POPLATEK MESICNE  961211    1
1588        67           POPLATEK MESICNE  931211    1
11382       74           POPLATEK MESICNE  950820    1
Length: 4500, dtype: int64

In [36]:
df_account['frequency'].unique()

array(['POPLATEK MESICNE', 'POPLATEK PO OBRATU', 'POPLATEK TYDNE'],
      dtype=object)

In [37]:
df_account.shape

(4500, 4)

In [38]:
def data_info(df):
    print("Intial information of Data ")
    return df.info()

In [39]:
data_info(df_account)

Intial information of Data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   account_id   4500 non-null   int64
 1   district_id  4500 non-null   int64
 2   frequency    4500 non-null   object
 3   date         4500 non-null   int64
dtypes: int64(3), object(1)
memory usage: 140.8+ KB

In [40]:
import cx_Oracle
dsn_tns = cx_Oracle.makedsn('localhost', '1521', service_name='orcl')
conn = cx_Oracle.connect(user=r'haresh', password='haresh2019', dsn=dsn_tns)
c = conn.cursor()

In [41]:
c.execute("select * from tab")

In [42]:
for i in c:
    print(i)

('ACCOUNT', 'TABLE', None)
('BIN$RlJ22QCjSQOUkafpQqkfRA==$0', 'TABLE', None)
('BIN$SVnAyidCToWdUqx0953+XA==$0', 'TABLE', None)
('BIN$qNU9ARPcQiK2b1DubANKGw==$0', 'TABLE', None)
('BIN$shgWz31bSueoMTGdw9QOHA==$0', 'TABLE', None)
('BIN$u/jvrFLbR/2G6506Ziu1YQ==$0', 'TABLE', None)
('CARD', 'TABLE', None)
('CLIENT', 'TABLE', None)
('DISP', 'TABLE', None)
('DISTRICT', 'TABLE', None)
('LOAN', 'TABLE', None)
('ORDER1', 'TABLE', None)
('TAB1', 'TABLE', None)
('TAB2', 'TABLE', None)
('TAB24', 'VIEW', None)
('TAB3', 'TABLE', None)
('TAB4', 'TABLE', None)
('TELCOM_CHURN', 'TABLE', None)
('TRANSACTION1', 'TABLE', None)
('TRANSACTION_A', 'TABLE', None)

In [ ]:
# creating table in oracle db
c.execute("create table account (account_id varchar2(30), district_id varchar2(30), frequency number, Acc_date number)")
c.execute("create table card (card_id varchar2(30), disp_id varchar2(30), type varchar2(30), issued varchar2(30))")
c.execute("create table client (client_id varchar2(30), birth_number varchar2(30), district_id varchar2(30))")
c.execute("create table disp (disp_id varchar2(30), client_id varchar2(30), account_id varchar2(30), type varchar2(30))")
c.execute("create table district (A1 varchar2(30), A2 varchar2(30), A3 varchar2(30), A4 number, A5 number, A6 number, A7 number, A8 number, A9 number, A10 number, A11 number, A12 number, A13 number,  A14 number,  A15 number,  A16 number )")
c.execute("create table loan (loan_id varchar2(30), account_id varchar2(30), loan_date varchar2(30), amount number, duration number, payments number, status varchar2(30))")
c.execute("create table order (order_id varchar2(30), account_id varchar2(30), bank_to varchar2(30), account_to varchar2(30), amount number, k_symbol varchar2(30))")
c.execute("create table transaction (trans_id varchar2(30), account_id varchar2(30), date number, type varchar2(30), operation varchar2(30), amount number, balance number, k_symbol varchar2(30), bank varchar2(30), account varchar2(30))")

In [ ]:
c.execute("commit")

In [ ]:
#dataframes = ['df_card', 'df_client', 'df_disp', 'df_district', 'df_load', 'df_order', 'df_trans', 'df_loan']

In [ ]:

for i in range(0, len(df_card)):
    c.execute("INSERT INTO CARD VALUES {}".format(tuple(df_card.values.tolist()[i])))
    c.execute("commit")
    
    
for i in range(0, len(df_client)):
    c.execute("INSERT INTO client VALUES {}".format(tuple(df_client.values.tolist()[i])))
    c.execute("commit")
    

for i in range(0, len(df_disp)):
    c.execute("INSERT INTO DISP VALUES {}".format(tuple(df_disp.values.tolist()[i])))
    c.execute("commit")

In [ ]:
for i in range(0, len(df_loan)):
    (tuple(df_loan.values.tolist()[i]))
    c.execute("INSERT INTO LOAN VALUES {}".format(tuple(df_loan.values.tolist()[i])))
    c.execute("commit")
    
    
for i in range(0, len(df_order)):
    (tuple(df_order.values.tolist()[i]))
    c.execute("INSERT INTO ORDER1 VALUES {}".format(tuple(df_order.values.tolist()[i])))
    c.execute("commit")
    

for i in range(0, len(df_trans)):
    (tuple(df_trans.values.tolist()[i]))
    c.execute("INSERT INTO TRANSACTION VALUES {}".format(tuple(df_trans.values.tolist()[i])))
    c.execute("commit")
    
    
for i in range(0, len(df_account)):
    c.execute("INSERT INTO ACCOUNT VALUES {}".format(tuple(df_account.values.tolist()[i])))
    c.execute("commit")

In [ ]:
for i in range(0, len(df_district)):
    c.execute("INSERT INTO DISTRICT VALUES {}".format(tuple(df_district.values.tolist()[i])))
    c.execute("commit")

In [38]:
df_trans = df_trans.astype(object).where(pd.notnull(df_trans), '')

In [ ]:
df_trans.info()

In [ ]:
df_trans.head()

In [39]:
for i in range(0, len(df_trans)):
    c.execute("INSERT INTO TRANSACTION1 VALUES {}".format(tuple(df_trans.values.tolist()[i])))
    c.execute("commit")

KeyboardInterrupt:

In [ ]:
df_trans.isna().sum(), len(df_trans)

In [ ]:
df_trans.info()

In [ ]:
df_trans

In [ ]:
df_trans.info()

In [ ]:
for i in range(0, len(df_trans)):
    c.execute("INSERT INTO transaction1 (trans_id, account_id, trans_date, type, operation, amount, balance, k_symbol, bank, account ) VALUES {}".format(tuple(df_trans.values.tolist()[i])))

In [43]:
df_trans

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
1056315,3626622,2906,981231,PRIJEM,NaN,62.3,13729.4,UROK,NaN,NaN
1056316,3627616,2935,981231,PRIJEM,NaN,81.3,19544.9,UROK,NaN,NaN
1056317,3625403,2869,981231,PRIJEM,NaN,60.2,14638.2,UROK,NaN,NaN
1056318,3626683,2907,981231,PRIJEM,NaN,107.5,23453.0,UROK,NaN,NaN
1056319,3626540,2902,981231,PRIJEM,NaN,164.1,41642.9,UROK,NaN,NaN

In [44]:
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1056320 entries, 0 to 1056319
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   trans_id    1056320 non-null  int64
 1   account_id  1056320 non-null  int64
 2   date        1056320 non-null  int64
 3   type        1056320 non-null  object
 4   operation   873206 non-null   object
 5   amount      1056320 non-null  float64
 6   balance     1056320 non-null  float64
 7   k_symbol    574439 non-null   object
 8   bank        273508 non-null   object
 9   account     295389 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 80.6+ MB

In [47]:
df_trans.isna().sum(), len(df_trans)

(trans_id           0
 account_id         0
 date               0
 type               0
 operation     183114
 amount             0
 balance            0
 k_symbol      481881
 bank          782812
 account       760931
 dtype: int64,
 1056320)

In [46]:
for i in range(0, len(df_trans)):
    c.execute("INSERT INTO transaction_a (trans_id, account_id) VALUES {}".format(tuple(df_trans[['trans_id', 'account_id']].values.tolist()[i])))
    c.execute("commit")

KeyboardInterrupt:

In [45]:
for i in range(0, 4):
    print(tuple(df_trans[['trans_id', 'account_id']].values.tolist()[i]))

(695247, 2378)
(171812, 576)
(207264, 704)
(1117247, 3818)